function [c,Iout]=ZernikeFitWithUnevenXY(I,mask,X,Y)
% I为输入波面；mask为有效像素掩膜板。
% c为35项泽尼克系数；Iout为拟合波面。
%

%将波面转化到极坐标系下
[w,r,t]=wrt(I,mask,X,Y);

%拟合
[c,I1]=Zernike_fit(w,r,t);
Iout=I;
Iout(mask==1)=I1(:);

%显示
%figure,subplot(1,2,1);imshow(I,[]);
%subplot(1,2,2);imshow(Iout,[]);

%%% 子函数 %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function [W,R,T]=wrt(wave,mask,X,Y)
%坐标系变换
%获得圆心和极坐标系下坐标

% [M,N]=size(wave);
% [X,Y]=meshgrid(1:N,1:M);
% NM=regionprops(mask,'Centroid');
% nm=NM.Centroid;
% nn=round(nm(1));
% mm=round(nm(2));
% Rmax=sum(max(mask))/2;
% X=(X-nn)./Rmax;
% Y=(Y-mm)./Rmax;
[th,r]=cart2pol(X,Y);
T=(th(mask==1))';
R=(r(mask==1))';
W=(wave(mask==1))';
%------------------------------------------------------------------------%
function [aj,WW]=Zernike_fit(W,r,th)
%使用前35项泽尼克多项式拟合，输入波面向量W，采样点的座标向量r和th;
%特别注意参数W，r，th必须是行向量
%返回一组多项式系数向量,根据泽尼克多项式的特性，拟合的波面必须是圆形孔径的；

Sik=Zernike_poly(r',th');
%计算协方差矩阵
Aij=Sik*Sik';
qsk=W-mean(W);
Ain=Sik*qsk';
%通过协方差矩阵得到多项式系数
aj=Aij\Ain;
WW=(Sik'*aj)';
%------------------------------------------------------------------------%
function sj=Zernike_poly(r,th)
%用于计算点（r，th）在泽尼克多项式各个基面上的值，作为一组行向量返回，不含常数项
%r，th为矩阵

%初始化
M=size(r);
sj=zeros(35,M(1),M(2));

%前35项zernike多项式
% si(0)=1;
sj(1,:,:)=r.*cos(th);            %y    y方向倾斜
sj(2,:,:)=r.*sin(th);            %x    x方向倾斜
sj(3,:,:)=2*r.^2-1;              %-1+2*y.^2+2*x.^2     离焦 
sj(4,:,:)=r.^2.*cos(2*th);       %y.^2-x.^2    像散    轴线方向为0度或90度
sj(5,:,:)=r.^2.*sin(2*th);       %2xy      像散      轴线方向为正负45度
sj(6,:,:)=-(3*r.^3-2*r).*cos(th); %-2y+3y.^3+3*x.^2*y     沿y轴的三级彗差
sj(7,:,:)=-(3*r.^3-2*r).*sin(th); %-2x+3x.^3+3*y.^2*x     沿x轴的三级彗差
sj(8,:,:)=6*r.^4-6*r.^2+1;       %1-6*y.^2-6*x.^2+6*y.^4+12*x.^2*y.^2+6*x.^4    三级球差
sj(9,:,:)=r.^3.*cos(3*th);
sj(10,:,:)=r.^3.*sin(3*th);
sj(11,:,:)=(4*r.^4-3*r.^2).*cos(2*th);
sj(12,:,:)=(4*r.^4-3*r.^2).*sin(2*th);
sj(13,:,:)=(10*r.^5-12*r.^3+3*r).*cos(th);
sj(14,:,:)=(10*r.^5-12*r.^3+3*r).*sin(th);
sj(15,:,:)=20*r.^6-30*r.^4+12*r.^2-1;
sj(16,:,:)=r.^4.*cos(4*th);
sj(17,:,:)=r.^4.*sin(4*th);
sj(18,:,:)=(5*r.^5-4*r.^3).*cos(3*th);
sj(19,:,:)=(5*r.^5-4*r.^3).*sin(3*th);
sj(20,:,:)=(15*r.^6-20*r.^4+6*r.^2).*cos(2*th);
sj(21,:,:)=(15*r.^6-20*r.^4+6*r.^2).*sin(2*th);
sj(22,:,:)=(35*r.^7-60*r.^5+30*r.^3-4*r).*cos(th);
sj(23,:,:)=(35*r.^7-60*r.^5+30*r.^3-4*r).*sin(th);
sj(24,:,:)=70*r.^8-140*r.^6+90*r.^4-20*r.^2+1;
sj(25,:,:)=r.^5.*cos(5*th);
sj(26,:,:)=r.^5.*sin(5*th);
sj(27,:,:)=(6*r.^6-5*r.^4).*cos(4*th);
sj(28,:,:)=(6*r.^6-5*r.^4).*sin(4*th);
sj(29,:,:)=(21*r.^4-30*r.^2+10).*r.^3.*cos(3*th);
sj(30,:,:)=(21*r.^4-30*r.^2+10).*r.^3.*sin(3*th);
sj(31,:,:)=(56*r.^6-105*r.^4+60*r.^2-10).*r.^2.*cos(2*th);
sj(32,:,:)=(56*r.^6-105*r.^4+60*r.^2-10).*r.^2.*sin(2*th);
sj(33,:,:)=(126*r.^8-280*r.^6+210*r.^4-60*r.^2+5).*r.*cos(th);
sj(34,:,:)=(126*r.^8-280*r.^6+210*r.^4-60*r.^2+5).*r.*sin(th);
sj(35,:,:)=252*r.^10-630*r.^8+560*r.^6-210*r.^4+30*r.^2-1;

